/**
 * ██╗   ██╗██╗  ████████╗██████╗  █████╗     ██████╗  ██████╗ ████████╗
 * ██║   ██║██║  ╚══██╔══╝██╔══██╗██╔══██╗    ██╔══██╗██╔═══██╗╚══██╔══╝
 * ██║   ██║██║     ██║   ██████╔╝███████║    ██████╔╝██║   ██║   ██║   
 * ██║   ██║██║     ██║   ██╔══██╗██╔══██║    ██╔══██╗██║   ██║   ██║   
 * ╚██████╔╝███████╗██║   ██║  ██║██║  ██║    ██████╔╝╚██████╔╝   ██║   
 *  ╚═════╝ ╚══════╝╚═╝   ╚═╝  ╚═╝╚═╝  ╚═╝    ╚═════╝  ╚═════╝    ╚═╝   
 * 
 * ©️ 𝟐𝟎𝟐𝟔 𝐉𝐮𝐚𝐧 𝐔𝐥𝐭𝐫𝐚 - 𝐌𝐮𝐥𝐭𝐢-𝐃𝐞𝐯𝐢𝐜𝐞 𝐖𝐡𝐚𝐭𝐬𝐀𝐩𝐩 𝐁𝐨𝐭 𝐒𝐲𝐬𝐭𝐞𝐦 𝐯𝟑.𝟎
 */

import { watchFile, unwatchFile } from 'fs'
import chalk from 'chalk'
import { fileURLToPath } from 'url'

global.owner = [
'527732671011', 
'165043362652249',
''
] 
 
global.mods = []
global.prems = []

global.emoji = '🕳'
global.emoji2 = '🔊'
global.namebot = '⋆˚࿔ 𝐔𝐋𝐓𝐑𝐀 𝐁𝐎𝐓 𝜗𝜚˚⋆'
global.botname = '⋆˚࿔ 𝐔𝐋𝐓𝐑𝐀 𝐁𝐎𝐓 𝜗𝜚˚⋆'
global.banner = 'https://files.catbox.moe/1ruf7n.jpg'
global.packname = '⋆˚࿔ 𝐔𝐋𝐓𝐑𝐀 𝐁𝐎𝐓 𝜗𝜚˚⋆'
global.author = '© 𝐂𝐫𝐞𝐚𝐝𝐨 𝐏𝐨𝐫 𝔍𝒖𝒂𝒏 𒀭'
global.sessions = 'Ultrabots'


const file = fileURLToPath(import.meta.url)
watchFile(file, () => {
unwatchFile(file)
console.log(chalk.redBright("Se actualizó el 'config.js'"))
import(`file://${file}?update=${Date.now()}`)
})
